Tareas/Entrega_tareas_2021/1001577699/public/assignment02.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-11 Sun 12:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Assignment02</title>
<meta name="author" content="Juan David Salcedo Hernández" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content">
<h1 class="title">Assignment02</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4973fe4">1. First activity</a></li>
<li><a href="#org9c0966e">2. Second activity</a></li>
</ul>
</div>
</div>
<p>
We first import the necessary packages
</p>
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff79c6;">import</span> pandas <span style="color: #ff79c6;">as</span> pd
</pre>
</div>

<div id="outline-container-org4973fe4" class="outline-2">
<h2 id="org4973fe4"><span class="section-number-2">1</span> First activity</h2>
<div class="outline-text-2" id="text-1">
<p>
We then import the dataset and read it with Pandas
</p>
<div class="org-src-container">
<pre class="src src-ipython">PATH = <span style="color: #f1fa8c;">'~/Downloads/PS4_1.csv'</span>
data_frame = pd.read_csv(PATH)
</pre>
</div>

<p>
We eliminate both &rsquo;Date&rsquo; and &rsquo;Unnamed: 1&rsquo; series.
</p>
<div class="org-src-container">
<pre class="src src-ipython">data_frame = data_frame.drop(columns=[<span style="color: #f1fa8c;">'Unnamed: 1'</span>, <span style="color: #f1fa8c;">'Date'</span>])
data_frame
</pre>
</div>

<pre class="example" id="org32325fe">
  Berri1  Maisonneuve_1  Maisonneuve_2  Brebeuf
  0        29             20             35      NaN
  1        19              3             22      NaN
  2        24             12             22      NaN
  3        24              8             15      NaN
  4       120            111            141      NaN
  ..      ...            ...            ...      ...
  360      66             29             52      0.0
  361      61             41             99      0.0
  362      89             52            115      0.0
  363      76             43            115      0.0
  364      53             46            112      0.0
  
  [365 rows x 4 columns]
</pre>

<p>
Now we wish to return, on a dictionary, the following items: &#x2026;
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #6272a4;"># </span><span style="color: #6272a4;">things to be recurrently used</span>
info = data_frame.describe()
columns = data_frame.columns
memory = data_frame.memory_usage()

num_colums = <span style="color: #ffb86c;">len</span>(columns)
names = data_frame.keys()
nonempty_registers = [info.loc[<span style="color: #f1fa8c;">'count'</span>, name]
                      <span style="color: #ff79c6;">for</span> name <span style="color: #ff79c6;">in</span> columns]
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">memory_usage = [[name, memory.loc[i, ]]]</span>
stats = [[name, info.loc[<span style="color: #f1fa8c;">'mean'</span>, name], info.loc[<span style="color: #f1fa8c;">'std'</span>, name], info.loc[<span style="color: #f1fa8c;">'max'</span>, name]]
         <span style="color: #ff79c6;">for</span> name <span style="color: #ff79c6;">in</span> columns]
</pre>
</div>
</div>
</div>

<div id="outline-container-org9c0966e" class="outline-2">
<h2 id="org9c0966e"><span class="section-number-2">2</span> Second activity</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-ipython">PATH2 = <span style="color: #f1fa8c;">'~/Downloads/Crimes_-_2019.csv'</span>
df = pd.read_csv(PATH2)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Juan David Salcedo Hernández</p>
<p class="date">Created: 2021-04-11 Sun 12:04</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.5)</p>
</div>
</body>
</html>
